[
    {
        "name": "Dune: It Begins",
        "date": "2021",
        "genre": "Action",
        "imdb": "8.0",
        "type": "movies",
        "url": "the_dune.php",
        "small_cover": "Images/Dune-Search-PP.jpg",
        "large_cover": "Images/Dune-Slider1.png",
        "trailers": "Videos/Dune_Trailer.mp4",
        "description": "A mythic and emotionally charged hero's journey, 'Dune' tells the story of Paul Atreides, a brilliant and gifted young man born into a great destiny beyond his understanding, who must travel to the most dangerous planet in the universe to ensure the future of his family and his people. As malevolent forces explode into conflict over the planet's exclusive supply of the most precious resource in existence-a commodity capable of unlocking humanity's greatest potential-only those who can conquer their fear will survive."
    },
    {
        "name": "The Witcher",
        "date": "2019",
        "genre": "Fantasy",
        "imdb": "8.2",
        "type": "series",
        "url": "the_witcher.php",
        "small_cover": "Images/TheWitcher-Search-PP.jpg",
        "large_cover": "Images/TheWitcher-Slider.jpg",
        "trailers": "Videos/TheWitcher_Trailer.mp4",
        "description": "The Witcher is a fantasy drama web television series created by Lauren Schmidt Hissrich for Netflix. It is based on the book series of the same name by Polish writer Andrzej Sapkowski. The Witcher follows the story of Geralt of Rivia, a solitary monster hunter, who struggles to find his place in a world where people often prove more wicked than monsters and beasts. But when destiny hurtles him toward a powerful sorceress, and a young princess with a special gift, the three must learn to navigate independently the increasingly volatile Continent.—aaltaiawy"
    },
    {
        "name":"The Walking Dead",
        "date":"2010",
        "genre":"Horror",
        "imdb":"8.1",
        "type":"series",
        "url":"the_walking_dead.php",
        "small_cover":"Images/TheWalkingDead-Search-PP.jpg",
        "large_cover":"Images/TheWalkingDead-Slider1.jpg",
        "trailers":"Videos/TheWalkingDead_Trailer.mp4",
        "description":"Sheriff Deputy Rick Grimes gets shot and falls into a coma. When awoken he finds himself in a Zombie Apocalypse. Not knowing what to do he sets out to find his family, after he's done that, he gets connected to a group to become the leader. He takes charge and tries to help this group of people survive, find a place to live and get them food. This show is all about survival, the risks and the things you'll have to do to survive."
    },
    {
        "name": "Doctor Strange:\n In Multiverse of Madness",
        "date": "2022",
        "genre": "Fantasy",
        "imdb": "6.9",
        "type": "movies",
        "url": "the_doctor_strange.php",
        "small_cover": "Images/DoctorStrange-Search-PP.jpeg",
        "large_cover": "Images/DoctorStrange-Slider.png",
        "trailers": "Videos/DoctorStrange_Trailer.mp4",
        "description": "Following the events of Spider-Man No Way Home, Doctor Strange unwittingly casts a forbidden spell that accidentally opens up the multiverse. With help from Wong and Scarlet Witch, Strange confronts various versions of himself as well as teaming up with the young America Chavez while traveling through various realities and working to restore reality as he knows it. Along the way, Strange and his allies realize they must take on a powerful new adversary who seeks to take over the multiverse"
    },
    {
        "name": "The Matrix",
        "date": "1999",
        "genre": "Sci-Fiction",
        "imdb": "8.7",
        "type": "movies",
        "url": "the_matrix.php",
        "small_cover": "Images/Matrix-Search-PP.jpeg",
        "large_cover": "Images/Matrix-Slider1.jpg",
        "trailers": "Videos/Matrix_Trailer.mp4",
        "description": "Thomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. As a rebel against the machines, Neo must confront the agents: super-powerful computer programs devoted to stopping Neo and the entire human rebellion."
    },
    {
        "name": "The Batman",
        "date": "2022",
        "genre": "Action",
        "imdb": "7.8",
        "type": "movies",
        "url": "the_batman.php",
        "small_cover": "Images/Batman-Search-PP.jpg",
        "large_cover": "Images/Batman-Slider1.jpg",
        "trailers": "Videos/Batman_Trailer.mp4",
        "description": "Two years of nights have turned Bruce Wayne into a nocturnal animal. But as he continues to find his way as Gotham's dark knight Bruce is forced into a game of cat and mouse with his biggest threat so far, a manic killer known as 'The Riddler' who is filled with rage and determined to expose the corrupt system whilst picking off all of Gotham's key political figures. Working with both established and new allies, Bruce must track down the killer and see him brought to justice, while investigating his father's true legacy and questioning the effect that he has had on Gotham so far as 'The Batman.'"

    },
    {
        "name":"Breaking Bad",
        "date":"2008",
        "genre":"Crime",
        "imdb":"9.5",
        "type":"series",
        "url":"the_breaking_bad.php",
        "small_cover":"Images/BreakingBad-Search-PP.jpg",
        "large_cover":"Images/BreakingBad-Slider.jpg",
        "trailers":"Videos/BreakingBad_Trailer.mp4",
        "description":"Walter White is a chemistry genius but works as a chemistry teacher at a high school in an Albuquerque, New Mexico. His life drastically changes when he's diagnosed with stage III terminal lung cancer and given a prognosis of two years to live. To ensure that his pregnant wife and handicapped teenage son have a financial future, he uses his chemistry background to create and sell the world's finest crystal methamphetamine. To sell his signature 'blue meth', he teams up with Jesse Pinkman, a former student of his. The meth makes them very rich very quickly, but it attracts the attention of his DEA brother-in-law, Hank. As Walter and Jesse's status in the drug world escalates, Walter becomes a dangerous criminal and Jesse becomes a hot-headed salesman."
    },
    {
        "name": "Dark",
        "date": "2017",
        "genre": "Mystery",
        "imdb": "8.7",
        "type": "series",
        "url": "the_dark.php",
        "small_cover": "Images/Dark-Search-PP.jpg",
        "large_cover": "Images/Dark-Slider.png",
        "trailers": "Videos/Dark_Trailer.mp4",
        "description": "A family saga with a supernatural twist, set in a German town, where the disappearance of two young children exposes the relationships among four families. The first German production from the world's leading Internet TV Network is set in a present-day German town where the disappearance of two young children exposes the double lives and fractured relationships among four families. In 10 hour-long episodes, the story takes on a surprising twist that ties back to the same town in 1986."
    },
    {
        "name": "Inside Out",
        "date": "2015",
        "genre": "Animation",
        "imdb": "8.1",
        "type": "kids",
        "url": "the_inside_out.php",
        "small_cover": "Images/InsideOut-Search-PP.jpg",
        "large_cover": "Images/InsideOut-Slider1.jpeg",
        "trailers": "Videos/InsideOut_Trailer.mp4",
        "description": "Growing up can be a bumpy road, and it's no exception for Riley, who is uprooted from her Midwest life when her father starts a new job in San Francisco. Like all of us, Riley is guided by her emotions - Joy, Fear, Anger, Disgust and Sadness. The emotions live in Headquarters, the control center inside Riley's mind, where they help advise her through everyday life. As Riley and her emotions struggle to adjust to a new life in San Francisco, turmoil ensues in Headquarters. Although Joy, Riley's main and most important emotion, tries to keep things positive, the emotions conflict on how best to navigate a new city, house and school."
    },
    {
        "name": "The Godfather",
        "date": "1972",
        "genre": "Crime",
        "imdb": "9.2",
        "type": "movies",
        "url": "the_gotfather.php",
        "small_cover": "Images/TheGotFather-Search-PP.jpg",
        "large_cover": "Images/TheGotFather-Slider.jpg",
        "trailers": "Videos/GodFather_Trailer.mp4",
        "description": "The Godfather 'Don' Vito Corleone is the head of the Corleone mafia family in New York. He is at the event of his daughter's wedding. Michael, Vito's youngest son and a decorated WWII Marine is also present at the wedding. Michael seems to be uninterested in being a part of the family business. Vito is a powerful man, and is kind to all those who give him respect but is ruthless against those who do not. But when a powerful and treacherous rival wants to sell drugs and needs the Don's influence for the same, Vito refuses to do it. What follows is a clash between Vito's fading old values and the new ways which may cause Michael to do the thing he was most reluctant in doing and wage a mob war against all the other mafia families which could tear the Corleone family apart."
    },
    {
        "name": "Minions",
        "date": "2015",
        "genre": "Animation",
        "imdb": "6.4",
        "type": "kids",
        "url": "the_minions.php",
        "small_cover": "Images/Minions-Search-PP.jpg",
        "large_cover": "Images/Minions-Slider1.jpg",
        "trailers": "Videos/Minions_Trailer.mp4",
        "description": "Ever since the dawn of time, the Minions have lived to serve the most despicable of masters. From the T-Rex to Napoleon, the easily distracted tribe has helped the biggest and the baddest of villains. Now, join protective leader Kevin, teenage rebel Stuart, and lovable little Bob on a global road trip. They'll earn a shot to work for a new boss, the world's first female supervillain, and try to save all of Minionkind from annihilation."
    },
    {
        "name": "The Platform",
        "date": "2019",
        "genre": "Horror",
        "imdb": "7.0",
        "type": "movies",
        "url": "the_platform.php",
        "small_cover": "Images/ThePlatform-Search-PP.jpg",
        "large_cover": "Images/ThePlatform-Slider.jpg",
        "trailers": "Videos/ThePlatform_Trailer.mp4",
        "description": "A mysterious place, an indescribable prison, a deep hole. An unknown number of levels. Two inmates living on each level. A descending platform containing food for all of them. An inhuman fight for survival, but also an opportunity for solidarity. Goreng wakes in a concrete cell on level 48. His cellmate Trimagasi explains that they are in 'the pit', a tower-style holding facility. Once per day, food arrives on 'the platform'—a solid slab of unspecified material—that lowers from level 0, stopping for two minutes on each level."
    },
    {
        "name": "Harry Potter and \nThe Deathly Hallows: Part 1",
        "date": "2010",
        "genre": "Adventure",
        "imdb": "7.7",
        "type": "movies",
        "url": "the_harry_potter.php",
        "small_cover": "Images/HarryPotter-Search-PP.png",
        "large_cover": "Images/HarryPotter-Slider1.jpg",
        "trailers": "Videos/HarryPotter_Trailer.mp4",
        "description": "Voldemort's (Ralph Fiennes') power is growing stronger. He now has control over the Ministry of Magic and Hogwarts. Harry (Daniel Radcliffe), Ron (Rupert Grint), and Hermione (Emma Watson) decide to finish Dumbledore's (Sir Michael Gambon's) work and find the rest of the Horcruxes to defeat the Dark Lord. But little hope remains for the trio and the rest of the Wizarding World, so everything they do must go as planned."
    },
    {
        "name": "Rings",
        "date": "2017",
        "genre": "Horror",
        "imdb": "4.5",
        "type": "movies",
        "url": "the_rings.php",
        "small_cover": "Images/TheRings-Search-PP.jpg",
        "large_cover": "Images/TheRings-Slider.jpg",
        "trailers": "Videos/Rings_Trailer.mp4",
        "description": "Julia becomes worried about her boyfriend, Holt, when he explores the dark urban legend of a mysterious video said to kill the watcher seven days after viewing. She sacrifices herself to save her boyfriend and in doing so makes a horrifying discovery: there is a 'movie within the movie' that no one has ever seen before."
    }
]